"""
Подвиг 1. Установите соответствия между магическими методами и операторами.

__eq__()--оператор меньше <
__ne__()--оператор меньше или равно <=
__lt__()--оператор больше или равно >=
__le__()--оператор неравенства !=
__gt__()--оператор равенства ==
__ge__()--оператор больше >
"""

# Вставьте правильные ответы в переменную
# Пример temp = ["__eq__()--оператор равенства ==", 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_5.test_3_5_1 import test_1

test_1(temp)
# END
