"""
Вам предстоит написать программу хранения информации по книгам: автор, заголовок, год издания, число страниц.
Помогут ли здесь классы для представления этой разнородной информации?

да, описать каждую книгу как объект класса "Книга" хорошая идея
нет, классы следует использовать не просто для хранения данных, а формирования внутри них некоторого функционала (алгоритма)
нет, использование классов в данной задаче не создаст дополнительных удобств и преимуществ (при программировании)
один класс в программе - это слишком расточительно
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test_1_2.test_1_2_5 import test_5

test_5(temp)
# END
