"""
Вам предстоит создать программу несложного графического редактора с рисованием различных графических примитивов (линия, прямоугольник, эллипс, треугольник и т.п.).
Будет ли иметь смысл использовать при ее реализации концепцию ООП?

да, ООП здесь может заметно упростить программный код
нет, программа слишком простая, чтобы было какое то преимущество от ООП
нет, простой графический редактор удобнее реализовать при использовании структурного программирования (без ООП)
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test_1_2.test_1_2_7 import test_7

test_7(temp)
# END
