"""
Можно ли создавать программы без использования ООП?

нет, ООП - неотъемлемая часть больших приложений
да, но только относительно простые
можно, но тогда придется отказаться от функционального подхода к программированию
да, например, используя парадигму структурного программирования (не включая ООП)
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test_1_2.test_1_2_4 import test_4

test_4(temp)
# END
