"""
Каким термином из ООП можно охарактеризовать универсальность интерфейса доступа к разным типам данных?

стандартизация
унификация
полиморфизм
инкапсуляция
наследование
"""

# Создайте список temp с правильными ответами через запятую
# Пример temp = ['ответ1', 'ответ2']
# Запустите файл на исполнение

# Вставьте правильные ответы в переменную
temp = []
# END

# TEST-TASK___________________________________
try:
    assert len(temp) == 1 and 'полиморфизм' in temp
except:
    print("Пока неправильно ...")
else:
    [print(_) for _ in temp]
    print()
    print('Правильно !')
