"""
В чем суть идеи наследования в ООП?

элементы родительских классов случайным образом перемешиваются при формировании новых (дочерних) классов
на основе одного или нескольких объектов классов создаются новые (дочерние) объекты
наследование позволяет как бы вынести «за скобки» общее для разных классов
на основе одного или нескольких классов создается новый (дочерний) класс
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test_1_2.test_1_2_3 import test_3

test_3(temp)
# END
