"""
Как следует воспринимать класс в ООП?

как фрагмент программы, которая выполняется при вызове этого класса
как шаблон, по которому конструируются объекты этого класса
как локальное хранилище разнородных данных, подобно базе данных
понятие КЛАСС в ООП не существует
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test_1_2.test_1_2_2 import test_2

test_2(temp)
# END
