"""Подвиг 2. Установите соответствия между магическими методами и их описаниями.

__setattr__() автоматически вызывается при удалении атрибута класса или объекта
__getattribute__() автоматически вызывается при обращении к несуществующему атрибуту класса или объекта
__getattr__() автоматически вызывается при обращении к атрибуту класса или объекта
__delattr__() автоматически вызывается при изменении атрибута класса или объекта
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_1.test_3_1_2 import test_2

test_2(temp)
# END
