"""Подвиг 1.
Что в языке Python называют магическими (dunder) методами?

aметоды с двумя нижними подчеркиваниями до и после имени метода, которые автоматически вызываются в определенных для них ситуациях
методы, отвечающие за создание и удаление объектов класса
любые методы с двумя нижними подчеркиваниями до и после своего имени
методы, через которые происходит работа с атрибутами класса или объектов
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_1.test_3_1_1 import test_1

test_1(temp)
# END
