"""
Подвиг 1. Выберите все верные утверждения, связанные с работой функции hash() для двух хешируемых объектов a и b языка Python.

если hash(a) != hash(b), то a != b
если объекты a != b, то hash(a) != hash(b)
если объекты a == b, то hash(a) == hash(b)
если hash(a) == hash(b), то a == b
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_6.test_3_6_1 import test_1

test_1(temp)
# END
