"""
Подвиг 2. Какую роль играет приватный (private) режим доступа атрибутов классов?

приватные атрибуты класса автоматически становятся локальными свойствами объектов этого класса
предостерегает программиста (использующего класс) от прямого использования приватных атрибутов вне класса
защищает приватные переменные от изменений (присвоить им значение можно только один раз)
скрывает приватные переменные и методы от прямого доступа к ним (по исходным именам) вне класса
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test2_1.test_2_1_2 import test_2

test_2(temp)
# END
