"""
Подвиг 5. Какую роль в классах играют сеттеры и геттеры и что они из себя представляют?

это публичные методы для считывания и записи значений в приватные переменные класса или его объектов
сеттеры - это публичные методы класса, объявленные с декоратором @setter, а геттеры - аналогичные методы класса, объявленные с декоратором @getter
это приватные методы для считывания и записи значений в приватные переменные класса или его объектов
это все публичные атрибуты класса или объектов, с которыми можно работать напрямую извне (классов и объектов)
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test2_1.test_2_1_5 import test_5

test_5(temp)
# END
