"""
Подвиг 4. Выберите все верные утверждения о приватных методах.


все магические методы приватны, так как перед их именами стоят два подчеркивания
если перед именем метода записаны два подчеркивания, то он является приватным, даже если после его имени прописать два подчеркивания
все магические методы публичны, т.к. после их имен стоят два подчеркивания
если перед именем метода и после него стоят два подчеркивания (например, __abc__()), то такой метод является публичным
все магические методы публичны, как исключения из общего правила
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test4_4.test_4_4_4 import test_4

test_4(temp)
# END
