"""
Подвиг 1. Отметьте все верные утверждения о приватных (private) и защищенных (protected) атрибутах классов.

приватные атрибуты, созданные в инициализаторе базового класса, недоступны (по их исходным именам) в дочерних классах
защищенные атрибуты создаются с целью их использования в текущем классе и во всех дочерних классах
защищенные атрибуты классов доступны всюду по их исходным именам, также как и публичные (public) атрибуты классов
приватные атрибуты создаются с целью их использования только в текущем классе
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test4_4.test_4_4_1 import test_1

test_1(temp)
# END
