"""
Подвиг 1. Что означает наследование классов?

это когда один класс использует методы любого другого класса
    это когда один класс (дочерний) расширяет функциональность другого (базового) класса
это когда базовый класс конструируется на основе одного или нескольких дочерних классов
это когда в родительском классе объявлен другой (базовый) класс
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = [""]
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test4_1.test_4_1_1 import test_1

test_1(temp)
# END
