"""Подвиг 1. Что делает магический метод __call__()?

позволяет вызывать класс как функцию, если в нем определен метод __call__()
вызывается перед вызовом каждого метода, объявленного в классе
позволяет вызывать объекты класса подобно функциям, в котором определен метод __call__()
позволяет вызывать и объекты и классы подобно функциям, если в классе определен метод __call__()
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_2.test_3_2_1 import test_1

test_1(temp)
# END
