"""Конструктор класса (метод __new__) можно записать со следующей сигнатурой:

def __new__(cls, *args, **kwargs): ...
Какую роль здесь играет первый параметр cls?

ссылка на класс, для которого создается объект
ссылка на новый созданный объект класса
ссылка на базовый класс
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test1_6.test_1_6_3 import test_3

test_3(temp)
# END
