"""В какой момент вызывается магический метод __new__()?

непосредственно перед созданием объекта класса
непосредственно перед уничтожением объекта класса сборщиком мусора
сразу после создания объекта класса
после вызова инициализатора класса - метода __init__()
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test1_6.test_1_6_1 import test_1

test_1(temp)
# END
