"""
class Loader:
    @classmethod
    def json_parse(cls): ...

За что отвечает параметр cls в методах класса, объявленных как указано выше:

Ссылка на класс Loader
Ссылка на текущий метод
Ссылка на экземпляр класса, из которого вызван метод
Ссылка на базовый класс
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test1_7.test_1_7_4 import test_4

test_4(temp)
# END
