"""
 Что называют атрибутами класса?
"""

# Переменные и имена методов (ссылки на методы) класса
# Только переменные класса
# Только методы класса
# Экземпляры (объекты) класса

# Вставьте правильные ответы в переменную
# После запустите файл на исполнение )
temp = []
# END

# TEST-TASK___________________________________
try:
    assert len(temp) == 1 and "Переменные и имена методов (ссылки на методы) класса" in temp
except:
    print("Пока неправильно попробуйте другие варианты")
else:
    print("Правильно !")
