"""
Сопоставьте значения из двух списков
__add__()--для реализации оператора сложения +
__sub__()--для реализации оператора вычитания -
__mul__()--для реализации оператора умножения *
__truediv__()--для реализации оператора деления /
__floordiv__()--для реализации оператора целочисленного деления //
__mod__()--для реализации оператора вычисления целого остатка от деления %
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['__add__()--для реализации оператора сложения +', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_4.test_3_4_1 import test_1

test_1(temp)
# END
