"""
Подвиг 2. Выберите все корректные утверждения для полиморфизма.

полиморфизм - это процесс (возможность) создания множества объектов одного и того же класса
полиморфизм встроен в Python через механизм ссылок (каждая переменная - это ссылка на данные любого существующего в программе типа)
полиморфизм можно реализовать только через механизм наследования, используя единый базовый класс
полиморфизм - это возможность через единый интерфейс взаимодействовать с объектами разных типов
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test4_5.test_4_5_2 import test_2

test_2(temp)
# END
