"""
 Что называется методом класса?
 """

# Любая переменная, объявленная внутри класса
# Любая (не статическая) функция, объявленная внутри класса
# Переменные и функции внутри класса
# Такого термина в ООП нет

# Вставьте правильные ответы в переменную
# После запустите файл на исполнение )
temp = []
# END

# TEST-TASK___________________________________
try:
    assert len(temp) == 1 and "Любая (не статическая) функция, объявленная внутри класса" in temp
except:
    print("Пока неправильно попробуйте другие варианты")
else:
    print("Правильно так держать !")
