"""
Подвиг 1. Какие виды исключений бывают в языке Python?


исключения в процессе компиляции программы (синтаксические)
исключения в процессе выполнения программы (момента исполнения)
исключения в работе интегрированной среды (например, PyCharm)
исключения в работе интерпретатора языка Python
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = [""]
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test5_1.test_5_1_1 import test_1

test_1(temp)
# END
