"""
Какую роль играет параметр self в методах класса?

это ссылка на класс, которому принадлежит метод
это ссылка на объект класса, из которого был вызван метод
это просто обязательный (зарезервированный) параметр для методов класса, через который можно передавать произвольные данные
это ссылка на текущий метод класса
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test1_4.test_1_4_3 import test_3

test_3(temp)
# END
