"""
Подвиг 1. Установите соответствия между магическими методами и их описаниями.

__getitem__()--получение значения по ключу item
__setitem__()--запись значения value по ключу key
__delitem__()--удаление элемента по ключу key
__setattr__()--вызывается при изменении атрибута класса или объекта
__getattribute__()--вызывается при обращении к атрибуту класса или объекта
__delattr__()--вызывается при удалении атрибута класса или объекта

удаление элемента по ключу key
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_8.test_3_8_1 import test_1

test_1(temp)
# END
