"""
Подвиг 3. Пусть в программе объявлен некоторый класс Book, в котором определен магический метод __bool__().
И создан объект book класса Book. Выберите все варианты команд, в которых будет происходить вызов магического метода __bool__().

len(book)
res = bool(book)
if book: ...
for b in book: ...
while book: ...
print(book)
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_7.test_3_7_3 import test_3

test_3(temp)
# END
