"""
Подвиг 8. Отметьте все верные определения для функций isinstance() и issubclass().

функция issubclass(cls1, cls2) возвращает True, если класс cls1 является подклассом класса cls2 но не его базовых классов
функция issubclass(obj, cls) возвращает True, если объект obj является объектом класса cls или какого-либо его базовых классов
    функция isinstance(obj, cls) возвращает True, если объект obj является объектом класса cls
функция isinstance(obj, cls) возвращает True, если объект obj является объектом класса cls но не его базовых классов
функция isinstance(cls1, cls2) возвращает True, если класс cls1 является подклассом класса cls2 или какого-либо его базовых классов
    функция issubclass(cls1, cls2) возвращает True, если класс cls1 является подклассом класса cls2
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test4_2.test_4_2_8 import test_8

test_8(temp)
# END
