# Вам предстоит написать программу хранения информации по книгам: автор, заголовок, год издания, число страниц.
# Помогут ли здесь классы для представления этой разнородной информации?
#  
#     да, описать каждую книгу как объект класса "Книга" хорошая идея
# нет, классы следует использовать не просто для хранения данных, а формирования внутри них некоторого функционала (алгоритма)
# нет, использование классов в данной задаче не создаст дополнительных удобств и преимуществ (при программировании)
# один класс в программе - это слишком расточительно
