"""
Установите соответствия между функциями и их описаниями.
"""

# delattr()   позволяет удалять атрибут в классе или объекте
# hasattr()   позволяет проверять атрибут на наличие в классе или объекте
# getattr()   позволяет получать значение указанного атрибута из класса или объекта
# setattr()   позволяет создавать новый атрибут или устанавливать значение уже существующего в классе или объекте

# TEST-TASK___________________________________
# Тест отсутствует, постарайтесь самостоятельно ответить
