"""
Выберите утверждения справедливые для классов языка Python.

Класс образует пространство имен для переменных и методов, объявленных в нем.
Класс описывает шаблон для формирования его объектов.
Каждый класс (объявленный в программе) можно воспринимать как новый (пользовательский) тип данных.
Классы порождаются от своих объектов.
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test1_3.test_1_3_2 import test_2

test_2(temp)
# END


