"""
Подвиг 3. В каких случаях целесообразно использовать объекты-свойства?

для удобства доступа к публичным атрибутам класса или объектов
для удобства доступа к приватным атрибутам класса или объектов
для реализации дополнительной логики (программы) в момент присваивания и считывания информации из атрибутов класса или объектов
для инициализации локальных свойств в момент создания объектов
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test2_2.test_2_2_3 import test_3

test_3(temp)
# END
