"""
Отметьте все формулировки справедливые для итератора.

это объект, который контролирует перебор элементов некоторой коллекции в заданном порядке
в общем случае, для каждого типа коллекции создается свой итератор, но взаимодействие с ним (итератором) происходит по единому алгоритму
это объект, который обеспечивает стандартный интерфейс для перебора элементов коллекции в заданном порядке
для полноценной работы с объектом-итератором в нем должны быть определены магические методы __iter__() и __next__()
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test3_9.test_3_9_1 import test_1

test_1(temp)
# END
