"""Подвиг 2.
Чем дескрипторы концептуально отличаются от объектов-свойств (property)?

в одном классе дескриптора можно единожды описать логику взаимодействия с внутренними (приватными или защищенными) переменными
один класс дескриптора способен заменить множество однотипных объектов-свойств
дескрипторы построены на объекта-свойствах и это, по сути, одно и то же
дескрипторы содержат объекты-свойства, т.е. они их как бы объединяют в одном классе
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test2_3.test_2_3_2 import test_2

test_2(temp)
# END
