"""Подвиг 1.
Что из себя представляют дескрипторы?

это класс, в котором обязательно прописан инициализатор __init__ и финализатор __del__
это любой класс, в котором объявлен специальный метод __get__
это класс, в котором определены только объекты-свойства (property)
это любой класс, в котором объявлены специальные методы __get__, __set__ и/или __del__
это любой класс, в котором объявлены специальные методы __get__ и __set__
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test2_3.test_2_3_1 import test_1

test_1(temp)
# END
