"""
Подвиг 1. Что называется множественным наследованием?


    это когда один дочерний класс непосредственно наследуется от нескольких базовых
это когда от одного базового класса объявляется несколько дочерних классов
это когда формируется цепочка наследования из нескольких классов: A -> B -> C и т. д.
это когда внутри одного класса объявляется несколько других классов
"""

# Вставьте правильные ответы в переменную
# Пример temp = ['ответ', 'ответ' ]
temp = []
# Запустите файл на исполнение для проверки

# TEST-TASK___________________________________
from test4_6.test_4_6_1 import test_1

test_1(temp)
# END
